app/Controllers/ProductController.php

    public function delete($id = null){
        $session = session();
        if (!$session->get('isLoggedIn')){
            echo view('/');
        }
        $ProductModel = new ProductModel();

        $data['producttable'] = $ProductModel->where('id', $id)->delete($id);
---
DELETE FROM `producttable`
WHERE `id` = '1'
AND `id` IN ('1')